Repository: 84000/data-translation-memory
Catalog: toh578-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བརྒྱད་སྟོང་པའི་གཟུངས།
en: The Dhāraṇī of “The Perfection of Wisdom in Eight Thousand Lines”

source: བཅོམ་ལྡན་འདས་མ་ཡུམ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to the Blessed Lady, the Mother Perfection of Wisdom.

source: ཏདྱ་ཐཱ། ཨོཾ་ཧྲཱིཿ ཤྲུ་ཏི་སྨྲྀ་ཏི་བི་ཛ་ཡེ་སྭཱ་ཧཱ། པྲཛྙཱ་པཱ་ར་མི་ཏཱ་ཡེ། སརྦ་དུརྒ་ཏི་ཤོ་དྷ་ཡ། རཱ་ཛཱ་ཡ་སྭཱ་ཧཱ།
en: tadyathā—oṃ hrīḥ śruti­smṛti­vijaye svāhā! prajñā­pāramitāyai sarva­durgati śodhaya rājāya svāhā!

source: འདི་བཟུང་བས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བརྒྱད་སྟོང་པ་གཟུང་བར་འགྱུར་རོ། །
en: By upholding this, one will have upheld The Perfection of Wisdom in Eight Thousand Lines.

source: ལྟས་ངན་པ་སྣ་ཚོགས་ཀྱང་བཟློག་གོ། །
en: It will block all kinds of negative omens.

source: ལས་ཀྱི་སྒྲིབ་པ་དང་། ངན་སོང་ཐམས་ཅད་རྣམ་པར་སྦྱོང་བར་འགྱུར་རོ། །
en: All karmic obscurations and unfavorable kinds of rebirth will be purified.

source: འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བརྒྱད་སྟོང་པའི་གཟུངས་རྫོགས་སོ།།
en: Here ends “The Dhāraṇī of ‘The Perfection of Wisdom in Eight Thousand Lines.’ ”
